In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Create database connection
connection_string = "postgres:postgres@localhost:5432/gdp"
engine = create_engine(f'postgresql://{connection_string}')

In [3]:
# Confirm tables
engine.table_names()

['gdp_data']

In [4]:
pd.read_sql_query('select * from gdp_data', con=engine).tail()

        date  real_gdp  current_gdp
859  03/2018       2.2          4.3
860  06/2018       4.2          7.6
861  09/2018       3.4          4.9
862  12/2018       2.2          4.1
863  03/2019       3.1          3.8

In [5]:
# Create database connection
connection_string = "postgres:postgres@localhost:5432/yield"
engine = create_engine(f'postgresql://{connection_string}')

In [6]:
# Confirm tables
engine.table_names()

['yield']

In [7]:
pd.read_sql_query('select * from yield', con=engine).tail()

,date,yield_1mo,yield_2mo,yield_3mo,yield_6mo,yield_1yr,yield_2yr,yield_3yr,yield_5yr,yield_7yr,yield_10yr,yield_20yr,yield_30yr
111,12/2017,1.096571,NaN,1.228437,1.378016,1.552706,1.696730,1.815159,2.070984,2.249190,2.371944,2.616143,2.816000
112,03/2018,1.439064,NaN,1.582314,1.774311,1.943133,2.160961,2.308296,2.536967,2.686917,2.761713,2.908154,3.033367
113,06/2018,1.724177,NaN,1.874293,2.055029,2.251847,2.476479,2.608297,2.764812,2.873117,2.919719,2.996320,3.084574
114,09/2018,1.957015,NaN,2.077545,2.251341,2.463722,2.670071,2.747549,2.813043,2.886032,2.927463,2.999978,3.066486
115,12/2018,2.259975,2.321269,2.359762,2.505005,2.668527,2.798742,2.838329,2.876344,2.958931,3.033968,3.170226,3.265445